In [1]:
import numpy as np
import pandas as pd

In [2]:
d={
    'col1':[1,2,3,4],
    'col2':[11,22,33,11],
    'col3':['abc','def','ghi','xyz']
}

In [3]:
d

{'col1': [1, 2, 3, 4],
 'col2': [11, 22, 33, 11],
 'col3': ['abc', 'def', 'ghi', 'xyz']}

In [38]:
df=pd.DataFrame(d)

In [39]:
df

   col1  col2 col3
0     1    11  abc
1     2    22  def
2     3    33  ghi
3     4    11  xyz

In [6]:
df['col2'].unique()

array([11, 22, 33], dtype=int64)

In [7]:
len(df['col2'].unique())

3

In [8]:
arr=np.arange(0,3)

In [9]:
# arr.unique() ERROR

In [10]:
df['col2'].value_counts()

11    2
22    1
33    1
Name: col2, dtype: int64

In [11]:
# APPLY METHOD

In [43]:
df['col1']=df['col1'].apply(lambda x:x*3)

In [36]:
df.apply(lambda x:x*3) # to all elements

In [44]:
df

   col1  col2 col3
0     3    11  abc
1     6    22  def
2     9    33  ghi
3    12    11  xyz

In [14]:
df.loc[1].apply(lambda x:x*2)

col1         4
col2        44
col3    defdef
Name: 1, dtype: object

In [15]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [16]:

df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [17]:
df.columns[1]

'col2'

In [18]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [19]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [20]:
df.index[0]

0

In [21]:
df1=df.set_index('col3')

In [22]:
df1.index

Index(['abc', 'def', 'ghi', 'xyz'], dtype='object', name='col3')

In [23]:
df.sort_values(by='col2') # index do not change

   col1  col2 col3
0     1    11  abc
3     4    11  xyz
1     2    22  def
2     3    33  ghi

In [24]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [25]:
  d2={
    'col1':[1,2,3,4],
    'col2':[11,22,33,11],
    'col3':['abc','def','ghi',np.nan]
}

In [26]:
df2=pd.DataFrame(d2)

In [27]:
df2

   col1  col2 col3
0     1    11  abc
1     2    22  def
2     3    33  ghi
3     4    11  NaN

In [28]:
df2.isnull() # gives true for nan or none

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False   True


# pivot table

In [29]:
 d3={
     'a':['foo','foo','foo','bar','bar','bar'],
     'b':['one','one','two','two','one','one'],
     'c':['x','y','x','y','x','y'],
     'd':[1,3,2,5,4,1]
 }

In [30]:
df3=pd.DataFrame(d3)

In [31]:
df3

     a    b  c  d
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [32]:
df3.pivot_table(values='d',index=['a','b'],columns='c')

c          x    y
a   b
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN